conception/partie_back/01_MCD/MCD_uml.puml
' Generated by Mocodo 4.3.2

@startuml "MCD"

!define Table(x) class "x" << (T,#d1e5f0) >>
!define pk(x) <b>x</b>
hide methods
left to right direction
skinparam groupInheritance 2
skinparam lineThickness 2
skinparam lineColor #d6604d
skinparam backgroundColor #f7f7f7
skinparam classAttributeFontColor #000000
skinparam classAttributeFontName Monospaced
skinparam classAttributeFontSize 14
skinparam classBackgroundColor #d1e5f0
skinparam classBorderColor #4393c3
skinparam classBorderThickness 2
skinparam classFontColor #000000
skinparam classFontName Arial
skinparam classFontSize 18
skinparam classHeaderBackgroundColor #92c5de

Table("messages") {
    {field} + pk(id_message)
    {field} + expediteur
    {field} + destinataire
    {field} + sujet
    {field} + contenu
}

"rapport" "*" --- "1" "utilisateur": "dénoncer"

Table("rapport") {
    {field} + pk(id_rapport)
    {field} + dénociateur
    {field} + dénoncé
    {field} + type
    {field} + raison
    {field} + détail
    {field} + état
}

Table("roles") {
    {field} + pk(id_roles)
    {field} + nom
}

"autorisations" "1..*" --- "*" "roles": "Affecter"

Table("autorisations") {
    {field} + pk(id_autorisations)
    {field} + nom
}

"messages" "*" --- "1" "utilisateur": "adresser"

"messages" "*" --- "1" "utilisateur": "recevoir"

"rapport" "*" --- "1" "utilisateur": "suspecter"

"roles" "1" --- "*" "utilisateur": "attribuer"

"utilisateur" "1" --- "*" "bibliothèque": "Ajouter"

Table("utilisateur") {
    {field} + pk(id_utilisateur)
    {field} + nom
    {field} + email
    {field} + pseudo
    {field} + mot_de_passe
    {field} + token
    {field} + derniere_connexion
}

"utilisateur" "1" --- "*" "avis": "Ecrire"

Table("bibliothèque") {
    {field} + pk(code_bibliotheque)
    {field} + nom
    {field} + est_modifiable
}

"utilisateur" "*" --- "1" "status": "conditionner"

Table("avis") {
    {field} + pk(id_avis)
    {field} + titre_avis
    {field} + note
    {field} + commentaire
}

Table("status") {
    {field} + pk(id_status)
    {field} + nom
}

"livre" "*" --- "*" "bibliothèque": "livre_bibliothèque"

Table("livre") {
    {field} + pk(id_livre)
    {field} + isbn
    {field} + genre
    {field} + titre
    {field} + auteur
    {field} + editeur
    {field} + date_publication
    {field} + image_vignette
    {field} + image
    {field} + description
    {field} + age_limite
    {field} + serie
    {field} + est_dans_favoris
    {field} + est_dans_bibliotheque
    {field} + nombre_avis
    {field} + moyenne_note
}

"livre" "1" --- "*" "avis": "posseder"

@enduml
